import { Fragment } from 'react';
import FloatingImage from '@/components/Layouts/FloatingImagesPage/FloatingImage';
import FloatingImagesPage from '@/components/Layouts/FloatingImagesPage/FloatingImagesPage';
import Post from '@/components/Layouts/Post';
import PostAsideWrapper from '@/components/Layouts/Post/PostAsideWrapper';
import PostBody from '@/components/Layouts/Post/PostBody';
import Card from '@/components/UI/Card';
import CarouselBootstrap from '@/components/UI/CarouselBootstrap';
import PageTransition from '@/components/UI/PageTransition';
import { museumCardsContent } from '@/utils/data';
import classes from './School.module.scss';

function School() {
    const pageTitle = 'Даскал Ботево училище';
    return (
        <PageTransition>
            <CarouselBootstrap type="withCard" items={[{ src: "https://muzeibotev.com/clients/152/files/images/PC280963.JPG", title: "150 години от смъртта на Ботев" }, { src: "https://muzeibotev.com/css/skins/custom/152/images/PC280921.JPG", title: "150 години от смъртта на Ботев" }]}></CarouselBootstrap>
            <Post>
                <PostBody history={{ nachalo: 'Начало', null: 'Музей', muzei: pageTitle }}>
                    <FloatingImagesPage>
                        <Fragment>
                            <h2>{pageTitle}</h2>
                            <p>Икономическият просперитет, относителната политическа самостоятелност и преди всичко “окопитените”, честни и работливи калоферци допринасят за обособяването на градеца в средище на Българското национално Възраждане. Повишеното материалното благосъстояние на една част от населението и щедрите дарения на калоферските търговци и занаятчии, позволяват отделянето на значителни средства за развитието образованието.</p>
                            <FloatingImage src="https://muzeibotev.com/clients/152/files/images/sn_9-2daskal%20botevo%20uchilishte.JPG" title="Даскал Ботевото училище" />
                            <p>Музей „Христо Ботев” организира и участва в научни сесии и конференции от национален и регионален характер. За повишаване на интереса към родната ни история, музеят организира и приема редица тематични и художествини изложби. Така той се стреми да задоволи нарасналите интереси на многобройните си посетители.</p>
                            <FloatingImage src="https://muzeibotev.com/clients/152/files/images/pic_5%20uchitelskata%20staya%20v%20daskal%20botevoto%20uchilishte(1).JPG" title="Училището отвътре" right />
                            <p>Килийни училища в Калофер се отварят още от 1820 г. Няколко години след създаването на Габровското училище през 1839 г. с помощтта на калоферските търговци от Одеса е открито взаимно мъжко училище в двора на църквата „Св.Богородица”. През 1848 г. е завършен строежът на новото мъжко четирикласно училище, а старото е превърнато в девическо. Училището е изградено по инициатива на Ботьо Петков – бащата на Христо Ботев, изцяло с дарения и доброволната помощ на калоферци. Добре подготвените учители, някои от тях и изтъкнати книжовници, издигат Калоферското училище между първите в страната. През училището било като учители или ученици преминават редица видни български възрожденци: Ботьо Петков, главен учител до 1869 г., Димитър Фингов, Иван Чунчев, Спас Съйков, Никола Касапски, Иван Вазов, Христо Ботев, акад. Никола Начов и много други.</p>
                            <p>Калофер не изостава и по отношение на девическото образование. Ежегодно в Девическото училище се учат около 200 ученички, а учителките са около 5. Сред тях са Парашкева Шушулова, Анастасия Узунова, Рахил Барак-Душанова. Ученичка на Ботьо Петков е и създателката на първото българско светско девическо училище – Анастасия Димитрова.</p>
                            <FloatingImage src="https://muzeibotev.com/clients/152/files/images/IMG_1705.JPG" title="Глобус" />
                            <p>На 26 юли 1877 г., по време на Руско-турската Освободителна война Калофер е напълно опожарен. Училището, библиотеката и целият му архив са унищожени. След Освобождението сградта е възстановена и училището отново приема жадните за знания млади калоферци.</p>
                            <p>През 1980 г. външният вид на сградата е възстановен във вида от 1865 г. и училището е превърнато в музей. В нея е разположена постоянната експозиция „Просветното дело в Калофер през епохата на Възраждането” , която проследява развитието на просветното дело в България и конкретно в Калофер. На втория етаж са показани възстановки на стаи от Взаимно и Класно училище, както и Учителската и Общинската стаи.</p>
                            <FloatingImage src="https://muzeibotev.com/clients/152/files/images/IMG_1706.JPG" title="Класна стая" right />
                            <p>На първия етаж се намира Художественият отдел на НМ „Христо Ботев”. В изложбата са експонирани оригинални произведения на български творци, пресъздали образа на Ботев върху платно и камък. Галерията притежава творби на Димитър Гюдженов, Златю Бояджиев, Йоан Левиев, Александър Поплилов и др.</p>
                            <p>Пред сградата се намира историческият камък, от който Ботев произнася паметната си реч на 11 май 1867 г.</p>
                            <p>Обслужва се от служителите на НМ „Христо Ботев” и работи с работното време на музея. Таксите за посещения се заплащат на касата на музея.</p>
                            <p>При предварителна заявка в стаята на Взаимното училище се провеждат „Уроци по родолюбие”, връчвания на свидетелства за завършен клас и др. мероприятия.</p>
                            <h4>Галерия:</h4>
                        </Fragment>
                    </FloatingImagesPage>
                </PostBody>
                <PostAsideWrapper cardsData={museumCardsContent} currentPageTitle={pageTitle} />
            </Post>
        </PageTransition>
    );
}

export default School;