export const poems = [{
    title: "Майце си",
    content: ["Ти ли си, мале, тъй жално пела,\nти ли си мене три годин клела,\nта скитник ходя злочестен ази\nи срещам това, що душа мрази?", "Бащино ли съм пропил имане,\nтебе ли покрих с дълбоки рани,\nта мойта младост, мале, зелена\nсъхне и вехне люто язвена?!", "Весел ме гледат мили другари,\nче с тях наедно и аз се смея,\nно те не знаят, че аз веч тлея,\nче мойта младост слана попари!", "Отде да знаят? Приятел нямам\nда му разкрия що в душа тая;\nкого аз любя и в какво вярвам -\nмечти и мисли - от що страдая.", "Освен теб, мале, никого нямам,\nти си за мене любов и вяра;\nно тука вече не се надявам\nтебе да любя: сърце догаря!", "Много аз, мале, много мечтаях\nщастие, слава да видим двама,\nсила усещах - що не желаях?\nНо за вси желби приготви яма!", "Една сал клета, една остана:\nв прегръдки твои мили да падна,\nта туй сърце младо, таз душа страдна\nда се оплачат тебе горкана...", "Баща и сестра и братя мили\nаз да прегърна искам без злоба,\nпък тогаз нека измръзнат жили,\nпък тогаз нека изгния в гроба!"],

},
{
    title: "Към брата си",
    content: ["Тежко, брате, се живее\nмежду глупци неразбрани;\nдушата ми в огън тлее,\nсърцето ми в люти рани.", "Отечество мило любя,\nнеговият завет пазя;\nно себе си, брате, губя,\nтия глупци като мразя.", "Мечти мрачни, мисли бурни\nса разпалили душа млада;\nах, ръка си кой ще турне\nна туй сърце, дето страда?", "Никой, никой! То не знае\nнито радост, ни свобода;\nа безумно как играе\nв отзив на плач из народа!", "Често, брате, скришом плача\nнад народен гроб печален;\nно, кажи ми, що да тача\nв тоя мъртъв свят коварен?", "Нищо, нищо! Отзив няма\nна глас искрен, благороден,\nпък и твойта й душа няма\nна глас божий - плач народен!"]
},
{
    title: "Елегия",
    content: ["Кажи ми, кажи, бедний народе,\nкой те в таз рабска люлка люлее?\nТоз ли, що спасителят прободе\nна кръстът нявга зверски в ребрата,\nили тоз, що толкоз годин ти пее:\n\"Търпи, и ще си спасиш душата?!\"", "Той ли, ил някой негов наместник,\nсин на Лойола и брат на Юда,\nпредател верен и жив предвестник\nна нови тегла за сиромаси,\nнов кърджалия в нова полуда,\nкой продал брата, убил баща си?!", "Той ли? - кажи ми. Мълчи народа!\nГлухо и страшно гърмят окови,\nне чуй се от тях глас за свобода:\nнамръщен само с глава той сочи\nна сган избрана - рояк скотове,\nв сюртуци, в реси и слепци с очи.", "Сочи народът, и пот от чело\nкървав се лее над камък гробен;\nкръстът е забит във живо тело,\nръжда разяда глозгани кости,\nсмок е засмукал живот народен,\nсмучат го наши и чужди гости!", "А бедният роб търпи и ние\nбез срам, без укор, броиме време,\nоткак е в хомот нашата шия,\nоткак окови влачи народа,\nброим и с вяра в туй скотско племе\nчакаме и ний ред за свобода!"]
},
{
    title: "Делба",
    content: ["По чуства сме братя ний с тебе\nи мисли еднакви ний таим,\nи вярвам, че в светът за нищо\nний няма с теб да се разкаем.", "Добро ли сме, зло ли правили,\nпотомството назе ще съди;\nа сега - дай ръка за ръка\nи напред със стъпки по-твърди!", "Спътник ни са били в животът\nстрадания, бедност в чужбина,\nно тях сме ний братски делили\nи пак ще ги делим двамина...", "Ще делим ний хорски укори,\nще търпим и присмех глупешки,\nще търпим, но няма да охнем\nпод никакви мъки човешки.", "И глава ний няма да сложим\nпред страсти и светски кумири:\nсърцето си вече казахме\nс печалните наши две лири...", "Напред сега с чуства и мисли\nпоследната делба да делим:\nда изпълним дума заветна -\nна смърт братко, на смърт да вървим!"]
},
{
    title: "До моето първо либе",
    content: ["Остави таз песен любовна,\nне вливай ми в сърце отрова -\nмлад съм аз, но младост не помня,\nпък и да помня, не ровя\nтуй, що съм ази намразил\nи пред тебе с крака погазил.", "Забрави туй време, га плачех\nза поглед мил и за въздишка:\nроб бях тогаз - вериги влачех,\nта за една твоя усмивка,\nбезумен аз светът презирах\nи чувства си в калта увирах!", "Забрави ти онез полуди,\nв тез гърди веч любов не грее\nи не можеш я ти събуди\nтам, де скръб дълбока владее,\nде сичко е с рани покрито\nи сърце зло в злоба обвито!", "Ти имаш глас чуден - млада си,\nно чуйш ли как пее гората?\nЧуйш ли как плачат сиромаси?\nЗа тоз глас ми копней душата,\nи там тегли сърце ранено,\nтам, де е се с кърви облено!", "О, махни тез думи отровни!\nЧуй как стене гора и шума,\nчуй как ечат бури вековни,\nкак нареждат дума по дума -\nприказки за стари времена\nи песни за нови теглила!", "Запей и ти песен такава,\nзапей ми, девойко, на жалост,\nзапей как брат брата продава,\nкак гинат сили и младост,\nкак плаче сиротна вдовица\nи как теглят без дом дечица!", "Запей, или млъкни, махни се!\nСърце ми веч трепти - ще хвръкне,\nще хвръкне, изгоро, - свести се!\nТам, де земя гърми и тътне\nот викове страшни и злобни\nи предсмъртни песни надгробни...", "Там... там буря кърши клонове,\nа сабля ги свива на венец;\nзинали са страшни долове\nи пищи в тях зърно от свинец,\nи смъртта й там мила усмивка,\nа хладен гроб сладка почивка!", "Ах, тез песни и таз усмивка\nкой глас ще ми викне, запее?\nКървава да вдигна напивка,\nот коя и любов немее,\nпък тогаз и сам ще запея\nщо любя и за що милея!..."]
},
{
    title: "На прощаване в 1868 г.",
    content: ["Не плачи, майко, не тъжи,\nче станах ази хайдутин,\nхайдутин, майко, бунтовник,\nта тебе клета оставих\nза първо чедо да жалиш!\nНо кълни, майко, проклинай\nтаз турска черна прокуда,\nдето нас млади пропъди\nпо тази тежка чужбина -\nда ходим да се скитаме\nнемили, клети, недраги!\nАз зная, майко, мил съм ти,\nче може млад да загина,\nах, утре като премина\nпрез тиха бяла Дунава!\nНо кажи какво да правя,\nкат си ме, майко, родила\nсъс сърце мъжко, юнашко,\nта сърце, майко, не трае\nда гледа турчин, че бесней\nнад бащино ми огнище:\nтам, дето аз съм пораснал\nи първо мляко засукал,\nтам, дето либе хубаво\nчерни си очи вдигнеше\nи с онази тиха усмивка\nв скръбно ги сърце впиеше,\nтам дето баща и братя\nчерни чернеят за мене!...\nАх, мале - майко юнашка!\nПрости ме и веч прощавай!\nАз вече пушка нарамих\nи на глас тичам народен\nсрещу врагът си безверни.\nТам аз за мило, за драго,\nза теб, за баща, за братя,\nза него ще се заловя,\nпък... каквото сабя покаже\nи честта, майко, юнашка!\nА ти, 'га чуеш, майнольо,\nче куршум пропей над село\nи момци вече наскачат,\nти излез, майко - питай ги,\nде ти е чедо остало?\nАко ти кажат, че азе\nпаднал съм с куршум пронизан,\nи тогаз, майко, не плачи,\nнито пък слушай хората,\nдето ще кажат за мене\n\"Нехранимайка излезе\", -\nно иди, майко, у дома\nи с сърце сичко разкажи\nна мойте братя невръстни,\nда помнят и те да знаят,\nче и те брат са имали,\nно брат им падна, загина,\nзатуй, че клетник не трая\nпред турци глава да скланя,\nсюрмашко тегло да гледа!\nКажи им, майко, да помнят,\nда помнят, мене да търсят:\nбяло ми месо по скали,\nпо скали и по орляци,\nчерни ми кърви в земята,\nземята, майко, черната!\nДано ми найдат пушката,\nпушката, майко, сабята,\nи дето срещнат душманин\nсъс куршум да го поздравят,\nа пък със сабя помилват...\nАко ли, майко, не можеш\nот милост и туй да сториш,\nто 'га се сберат момите\nпред нази, майко, на хоро\nи дойдат мойте връстници\nи скръбно либе с другарки,\nти излез, майко, послушай\nсъс мойте братя невръстни\nмоята песен юнашка -\nзащо и как съм загинал\nи какви думи издумал\nпред смъртта си и пред дружина...\nТъжно щеш, майко, да гледаш\nи на туй хоро весело,\nи като срещнеш погледът\nна мойто либе хубаво,\nдълбоко ще ми въздъхнат\nдве сърца мили за мене -\nнейното, майко, и твойто!\nИ две щат сълзи да капнат\nна стари гърди и млади...\nНо туй щат братя да видят\nи кога, майко, пораснат,\nкато брата си ще станат -\nсилно да любят и мразят...\nАко ли, мале, майноле,\nжив и здрав стигна до село,\nжив и здрав с байряк във ръка,\nпод байряк лични юнаци,\nнапети в дрехи войнишки,\nс левове златни на чело,\nс иглянки пушки на рамо\nи с саби-змии на кръстът,\nо, тогаз, майко юнашка!\nО, либе мило, хубаво!\nБерете цветя в градина,\nкъсайте бръшлян и здравец,\nплетете венци и китки\nда кичим глави и пушки!\nИ тогаз с венец и китка\nти, майко, ела при мене,\nела ме, майко прегърни\nи в красно чело целуни -\nкрасно, с две думи заветни:\nсвобода и смърт юнашка!\nА аз ще либе прегърна\nс кървава ръка през рамо,\nда чуй то сърце юнашко,\nкак тупа сърце, играе;\nплачът му да спра с целувка,\nсълзи му с уста да глътна...\nПък тогаз... майко, прощавай!\nТи, либе, не ме забравяй!\nДружина тръгва, отива,\nпътят е страшен, но славен:\nаз може млад да загина...\nНо... стига ми тая награда -\nда каже нявга народът:\nумря сиромах за правда,\nза правда и за свобода..."]
},
{
    title: "Хайдути (Баща и син)",
    content: ["Я надуй, дядо, кавала,\nслед теб да викна - запея\nпесни юнашки, хайдушки,\nпесни за вехти войводи -\nза Чавдар страшен хайдутин,\nза Чавдар вехта войвода -\nсинът на Петка Страшника!\nДа чуят моми и момци\nпо сборове и по седенки;\nюнаци по планините,\nи мъже в хладни механи:\nкакви е деца раждала,\nраждала, ражда и сега\nбългарска майка юнашка;\nкакви е момци хранила,\nхранила, храни и днеска\nнашата земя хубава!\nАх, че мен, дядо, додея\nлюбовни песни да слушам,\nа сам за тегло да пея,\nза тегло, дядо, сюрмашко,\nи за свойте си кахъри,\nкахъри, черни ядове!\nТъжно ми й, дядо, жално ми й,\nала засвири - не бой се, -\nаз нося сърце юнашко,\nглас имам меден загорски,\nта‘ко ме никой не чуе,\nпесента ще се пронесе\nпо гори и по долища -\nгорите ще я поемат,\nдолища ще я повторят,\nи тъгата ми ще мине,\nтъгата, дядо, от сърце!\nПък който иска, та тегли -\nтежко му нима ще кажа?\nЮнакът тегло не търпи -\nала съм думал и думам:\nБлазе му, който умее\nза чест и воля да мъсти -\nдоброму добро да прави,\nлошия с ножа по глава, -\nпък ще си викна песента!", "I", "Кой не знай Чавдар войвода,\nкой не е слушал за него?\nЧорбаджия ли изедник,\nили турските сердари?\nОвчар ли по планината,\nили пък клети сюрмаси!\nВодил бе Чавдар дружина\nтъкмо до двайсет години\nи страшен беше хайдутин\nза чорбаджии и турци;\nала за клети сюрмаси\nкрило бе Чавдар войвода!\nЗатуй му пее песента\nна Странджа баир гората,\nна Ирин-Пирин тревата;\nмеден им кавал приглаша\nот Цариграда до Сръбско\nи с ясен ми глас жътварка\nот Бяло море до Дунав -\nпо румелийски полета...\nЕдин бе Чавдар войвода -\nедин на баща и майка,\nедин на вярна дружина;\nмъничък майка остави,\nглупав от татка отдели,\nбез сестра, Чавдар, без братец,\nни нийде някой роднина -\nедин сал вуйка изедник\nи деветмина дружина!...\nХлапак дванайсетгодишен,\nовчар го даде майка му,\nпо чужди врата да ходи,\nна чужд хляб да се научи;\nно стоя Чавдар, що стоя -\nстоял ми й от ден до пладня!\nИ какво да ми спечели?\nГолям армаган на майка -\nтез тежки думи отровни:\n\"Що ме си, майко, продала\nна чуждо село аргатин:\nовци и кози да паса,\nда ми се смеят хората\nи да ми думат в очите:\nда имам баща войвода\nнад толкозмина дружина,\nтри кази да е наплашил,\nда владей Стара планина,\nа аз при вуйча да седя -\nпри тоз сюрмашки изедник!\nкопилето му да бавя;\nчас по час да ме нахоква,\nче съм се и аз увълчил,\nче човек няма да стана,\nа ще да гния в тъмница,\nи ще ми капнат месата\nна Кара баир на кола!...\nПроклет бил човек вуйка ми!\nПроклет е, майко - казвам ти,\nне ща при него да седя,\nкопилето му да бавя\nи крастите да му завръщам.\nЯли ги свраки и псета!\nПри татка искам да ида,\nпри татка в Стара планина;\nтатко ми да ме научи\nна к’ъвто иска занаят.\"\nЗави се майка, замая -\nкамък и падна на сърце;\nгледа си в очи Чавдара,\nвъв очи черни, големи,\nглади му глава къдрава\nи ръда клета, та плаче.\nЧавдар я плахо изгледа,\nи с сълзи и той на очи,\nмайка си бърже попита:\n\"Кажи ми, мале, що плачеш?\nДа не са татка хванали,\nхванали или убили,\nта ти си, мале, остала\nсирота, гладна и жъдна?\"...\nПрегърна майка Чавдара,\nв очи го черни целуна,\nвъздъхна, та му продума:\n\"За тебе плача, Чавдаре,\nза тебе, дете хубаво,\nписано още шарено:\nти ми си, синко, едничък,\nедничък още мъничък,\nа лоши думи хортуваш; -\nкак ще те майка прежали,\nда идеш, синко, с татка си,\nхайдутин като ще станеш!\nТатко ти й снощи доходял,\nза тебе, синко, да пита -\nмного ме й съдил и хокал,\nщо съм те, синко, пратила\nпри вуйча ти, а не при него -\nда види и той, че има\nхубаво дете юначе;\nдалеч ли да го проводи,\nна книга да се изучи,\nили хайдутин направи,\nпо планината да ходи.\nТриста й заръци заръчал,\nв неделя да те проводя\nна хайдушкото сборище...\nЩе идеш, синко Чавдаре,\nедничко чедо на майка!\nЩе идеш утре при него;\nала те клетва заклинам,\nако ти й мила майка ти,\nда плачеш, синко, да искаш,\nс дружина да те не води,\nа да те далеч проводи,\nна книга да се изучиш -\nмайци си писма да пишеш,\nкога на гурбет отидеш...\"", "Рипна ми Чавдар от радост,\nче при татка си ще иде,\nстрашни хайдути да види\nна хайдушкото сборище;\nа майка ядна, жалостна,\nдете си мило прегърна\nи... пак заръда, заплака!...", "„Хайдути” е една от първите творби на Христо Ботев, създадена вероятно в Одеса и публикувана по-късно във в. „Дума на българските емигранти” (1871 г.). Останала е незавършена."]
},
{
    title: "Пристанала",
    content: [
        "Кавал свири на поляна,\nна поляна, край горица;\nмлада, хубава Стояна\nтърчи с менци за водица.",
        "Из градина крещи, вика\nомразната нейна стрика:\n\"Полудя ли, мар Стояно,\nта отиваш толкоз рано?",
        "Стой, почакай д’идем двама!\"\nПа се спусна к’нейна мама\nда ковлади тя Стояна,\nче отива на поляна.",
        "Ей изкочи стара майка\nна висок и хубав чардак:\nахна, търти се, заплака,\nкато видя кървав байряк,",
        "че се байряк там ветрее\nсред юнаци, сред дружина\nи Стоянка се белее\nв прегръдките у Дойчина.",
        "Като зърна той, че иде\nнеговото мило либе,\nиз юнаци той изскочи\nи към нея с пръст посочи:",
        "\"Ей, дружина, хай станете!\nЕй я иде - погледнете:\nтуй е мойта горска птица,\nтуй е мойта годеница!\"",
        "Па си весел, засмян тръгна\nда посрещне той Стояна;\nнаближи я - с пушка гръмна,\nкато видя, че й засмяна.",
        "И дружина загърмяха\nна засевки, та запяха;\nа тя ръце си разгърна,\nта Дойчин я млад прегърна.",
        "А нейната клета мама,\nкато гледа таз измама,\nсълзи лее и проклина\nту щерка си, ту Дойчина.",
        "\"Да не цъфнеш, да не пекнеш,\nдъще клета, със Дойчина,\nда окапеш, дето седнеш -\nда не станеш по година!",
        "Дано болест те налегне,\nболест, дъще, живеница,\nи Дойчин да не убегне\nот верига, от темница!",
        "Тоз хайдутин, що го любиш,\nна кол утре да го видиш,\nче от там се тебе хили\nи на горски самодиви!",
        "Че той батя ти измами,\nта хайдутин върл направи;\nа теб, дъще, клета, мами,\nбаща, майка та остави!\"",
        "От тез клетви се събуди\nи Стоенкин баща стари;\nтой излезе и се чуди\nи в главата се удари.",
        "Но кат видя той Дойчина,\nдъщеря си и мил сина,\nпопоглади си брадата\nи извика към гората:",
        "\"Горо, горо, майко мила,\nтолкоз годин си хранила\nмене, горо, юнак стари\nс отбор момци и другари, -",
        "храни, горо, таквиз чеда,\nдорде слънце в светът гледа;\nдорде птичка в тебе пее,\nтоз байряк да се ветрее!\""
    ]
},
{
    title: "Борба",
    content: ["В тъги, в неволи, младост минува,\nкръвта се ядно в жили вълнува,\nпогледът мрачен, умът не види\nдобро ли, зло ли насреща иде...\nНа душа лежат спомени тежки,\nзлобна ги памет често повтаря,\nв гърди ни любов, ни капка вяра,\nнито надежда от сън мъртвешки\nда можеш свестен човек събуди!\nСвестните у нас считат за луди,\nглупецът вредом всеки почита:\n\"Богат е\", казва, пък го не пита\nколко е души изгорил живи,\nсироти колко той е ограбил\nи пред олтарят бога измамил\nс молитви, с клетви, с думи лъжливи.\nИ на обществен тоя мъчител\nи поп, и черква с вяра слугуват;\nнему се кланя дивак учител,\nи с вестникарин зайдно мъдруват,\nче страх от бога било начало\nна сяка мъдрост... Туй е казало\nстадо от вълци във овчи кожи,\nкамък основен за да положи\nна лъжи святи, а ум човешки\nда скове навек в окови тежки!\nСоломон, тоя тиран развратен,\nотдавна в раят нейде запратен,\nсъс свойте притчи между светците,\nказал е глупост между глупците,\nи нея светът до днес повтаря -\n\"Бой се от бога, почитай царя!\"\nСвещена глупост! Векове цели\nразум и совест с нея се борят;\nборци са в мъки, в неволи мрели,\nно, кажи, що са могли да сторят!\nСветът, привикнал хомот да влачи,\nтиранство и зло и до днес тачи;\nтежка желязна ръка целува,\nлъжливи уста слуша със вяра:\nмълчи, моли се, кога те бият,\nкожата да ти одере звярът\nи кръвта да ти змии изпият,\nна бога само ти се надявай:\n\"Боже, помилуй - грешен съм азе\",\nдумай, моли се и твърдо вярвай -\nбог не наказва, когото мрази...\nТъй върви светът! Лъжа и робство\nна тая пуста земя царува!\nИ като залог из род в потомство\nден и нощ - вечно тук преминува.\nИ в това царство кърваво, грешно,\nцарство на подлост, разврат и сълзи,\nцарство на скърби - зло безконечно!\nкипи борбата и с стъпки бързи\nвърви към своят свещен конец...\nЩе викнем ние: \"Хляб или свинец!\""]
},
{
    title: "Странник",
    content: [
        "Бързай, странник, върви скоро\nкъща бащина да стигнеш,\nпред къщата играй хоро,\nпрез хорото ти ще минеш.",
        "\"Добре дошел\", ще ти кажат\nдеца, баби и подевки;\nа момите - те играят\nподир дружкини засевки.",
        "Няма нищо! Други зема\nтази, що си нявга любил;\nно и за теб моми има:\nбог не си с камъни бил.",
        "Ще излезе стара майка\nда посрещне мила сина,\nще заплаче, ще завайка:\n\"Син дочаках от чужбина!\"",
        "Ще прегърне мъжка снага,\nа ти нейни стари кости;\nще чуйш майчина си тъга,\nще чуйш нейни думи прости.",
        "Ще чуйш, ала недей плака,\nпърво либе че сгодили,\nдруга вест те тебе чака -\nза баща и братя мили!",
        "Турци тейка ти убиха,\nбратята ти и двоица\nполежаха, па изгниха,\nотровени във темница.",
        "Но то нищо! Ти да си жив,\nбаща скоро ще да бъдеш, -\nбог е добър и милостив,\nа ти трябва род да въдиш.",
        "На, че плачеш! Ех, жена си!\nЗа жени е плачът даден,\nза жени, за сиромаси:\nти не си ни гол, ни гладен.",
        "Речи тамо: \"Бог да прости\",\nна попове по патрихил,\nна трапеза свикай гости,\nпък бъди, какъвто си бил!",
        "Земи жена хубавица\nили грозна със имот;\nнароди рояк дечица\nи с сюрмашки ги храни пот.",
        "Тъй глупецът, тъй залита\nда прекара добър живот,\nи никога не се пита\nчовек ли е той или скот!"
    ]
},
{
    title: "Ней",
    content: ["Питаш ме, защо съм аз\nдохождал нощя у вас,\nкак съм скочил през плета\nи що щял съм да крада.", "Кат мъжът ти не съм стар\nда не видя в темна нощ:\nаз си имам за другар\nна поясът остър нож.", "Нощ бе темна като рог,\nпримъкнах се като смок:\nслушам, гледам - сички спят,\nспеше си и ти с мъжът.", "Там в градина аз седнах,\nв ръка силна нож стиснах:\nще излезе, рекох той,\nще изпита гневът мой.", "Гледам вкъщи свещ гори,\nвие спите - мен в гърди\nсилен пламък, яд гори\nи гняв ще ме умори.", "Впил съм очи във свещта,\nа не виждам, че нощта\nпревали се и мина\nи зора се веч сипна.", "Славей песен си запя:\nс радост среща той зора:\nпрез прозорецът глава\nсе показа и засмя.", "Тебе тутакси познах\nи тогаз се чак стреснах:\n\"Друг път\", славею казах\nи през плетът пак скокнах.", "Ето защо идвах аз\nв темна нощ и грозен час:\nще умре един от нас -\nил мъжът ти, или аз!"]
},
{
    title: "Гергьовден",
    content: ["        \"Паситесь, добрые народы!\n        Вас не разбудит чести клыч;\n        Начто стадам дары свободы?\n        Их должно резать или стричь...\"\n               Языков", "Ликуй, народе! Старо и младо,\nхвалете и днес бога и царят!\nДнес е Гергьовден. От овце стадо\nтъй блейше вчера подир овчарят,\nкогато тоз цар, безгрижен, глупав,\nкакто и сички царьове земни,\nповеде стадо с кривакът хубав\nи с умни псета - министри верни,\nбез портфейли, но и без заплата,\nна кои същ цар и да погледне,\n\"Блазе й - би казал - живей овцата\nи от народът мой по-честито!\"\nИ тръгна стадо с агнета дребни,\nвърви и крета от път убито,\nта сичко младо под нож да легне\nза свети Гергя - божи разбойник...\nБездушен, глуп, изгнил покойник\nжертви ли иска? Иска овчарят,\nгладното гърло, попът пиени,\nкакто от тебе, народе, царят\nиска за свойте гнусни хареми\nи за тез, що те мъчат, обират;\nа ти им даваш потът, кръвта си\nи играйш даже, кога те бият!\nНа - днес богати и сиромаси,\nпиени там - те песни пеят\nи хвалят с попът бога и царят...\nЛикуй, народе! Тъй овце блеят\nи вървят с псета подир овчарят."]
},
{
    title: "Патриот",
    content: ["Патриот е - душа дава\nза наука, за свобода;\nно не свойта душа, братя,\nа душата на народа!\nИ секиму добро струва,\nсамо, знайте, за парата,\nкато човек - що да прави?\nпродава си и душата.", "И е добър християнин:\nне пропуща литургия;\nно и в черква за туй ходи,\nче черквата й търговия!\nИ секиму добро струва,\nсамо, знайте, за парата,\nкато човек - що да прави?\nзалага си и жената.", "И е човек с добро сърце:\nне оставя сиромаси;\nно не той вас, братя, храни,\nа вий него със трудът си!\nИ секиму добро струва,\nсамо, знайте, за парата,\nкато човек - що да прави?\nизяда си и месата."]
},
{
    title: "Защо не съм",
    content: ["Защо не съм и аз поет,\nпоет като Пишурката?\nЕх, че ода бих направил\nна баба си на хурката!", "Защо не съм и аз поет,\nкато Сапунова трети!\nЧе запял бих, че възпял бих\nна владиката конете!", "Но защо не съм Владикин,\nда напиша чудна драма -\nза жабите, за мишките,\nи боят им с цар Радана?", "Защо не съм и Войников,\nплодовит, прочут списател,\nда съставя и молитви\nна нашия цар създател?", "Защо не съм и Пърличев,\nда преведа Илиада;\nно с такъв превод, за който\nи лобут да ми се пада?", "Но защо не съм Славейков,\nда заплача, да запея:\n\"Не пей ми се, не смей ми се,\nот днес вече ще да блея\"?", "Но защо не съм и Вазов,\n\"вярата\" си да възпея:\nче ще стане вълк овцата,\nа певците като нея?!"]
},
{
    title: "Послание (на св. Търновски)",
    content: ["Свети владико! Пастир народен!\nДнес тебе песен пея за слава\nи казвам: отче, ти си достоен\nне за епархия - за държава;\nно като човек религиозен\nискам да зная - ще знаем двама -\nде е и нашът попец опопен -\nв черковата ли, или в хамама?\nЗащото, отче, в село приказват,\nче в Ески Захра кога си ходил,\nдръво ли, поп ли - това не знаят -\nна баните си го уж опопил."]
},
{
    title: "Хаджи Димитър",
    content: [
        "Жив е той, жив е! Там на Балкана,\nпотънал в кърви лежи и пъшка\nюнак с дълбока на гърди рана,\nюнак във младост и в сила мъжка.",
        "На една страна захвърлил пушка,\nна друга сабля на две строшена;\nочи темнеят, глава се люшка,\nуста проклинат цяла вселена!",
        "Лежи юнакът, а на небето\nслънцето спряно сърдито пече;\nжътварка пее нейде в полето,\nи кръвта още по–силно тече!",
        "Жътва е сега... Пейте, робини,\nтез тъжни песни! Грей и ти, слънце,\nв таз робска земя! Ще да загине\nи тоя юнак... Но млъкни, сърце!",
        "Тоз, който падне в бой за свобода,\nтой не умира: него жалеят\nземя и небе, звяр и природа\nи певци песни за него пеят...",
        "Денем му сянка пази орлица,\nи вълк му кротко раната ближи;\nнад него сокол, юнашка птица,\nи тя се за брат, за юнак грижи!",
        "Настане вечер – месец изгрее,\nзвезди обсипят сводът небесен;\nгора зашуми, вятър повее, –\nБалканът пее хайдушка песен!",
        "И самодиви в бяла премена,\nчудни, прекрасни, песен поемнат, –\nтихо нагазят трева зелена\nи при юнакът дойдат, та седнат.",
        "Една му с билки раната върже,\nдруга го пръсне с вода студена,\nтретя го в уста целуне бърже, –\nи той я гледа, – мила, зесмена!",
        "\"Кажи ми, сестро де – Караджата?\nДе е и мойта вярна дружина?\nКажи ми, пък ми вземи душата, –\nаз искам, сестро, тук да загина!\"",
        "И плеснат с ръце, па се прегърнат,\nи с песни хвръкнат те в небесата, –\nлетят и пеят, дорде осъмнат,\nи търсят духът на Караджата...",
        "Но съмна вече! И на Балкана\nюнакът лежи, кръвта му тече, –\nвълкът му ближе лютата рана,\nи слънцето пак пече ли – пече!",
        "Творбата е печатана за първи път във в. \"Независимост\", 1873 г. Кога точно е създадена, не се знае. Захари Стоянов по спомени на съвременници твърди, че Ботев я е декламирал дълго преди публикацията. С малки поправки стихотворението е публикувано в \"Песни и стихотворения\". "
    ]
},
{
    title: "В механата",
    content: ["Тежко, тежко! Вино дайте!\nПиян дано аз забравя\nтуй, що, глупци, вий не знайте\nпозор ли е или слава!", "Да забравя край свой роден,\nбащина си мила стряха\nи тез, що в мен дух свободен,\nдух за борба завещаха!", "Да забравя род свой беден,\nгробът бащин, плачът майчин, -\nтез, що залъкът наеден\nграбят с благороден начин, -", "грабят от народът гладен,\nграби подъл чорбаджия,\nза злато търговец жаден\nи поп с божа литургия!", "Грабете го, неразбрани!\nГрабете го! Кой ви бърка?\nСкоро той не ще да стане:\nний сме синца с чаши в ръка!", "Пием, пеем буйни песни\nи зъбим се на тирана;\nмеханите са нам тесни -\nкрещим: \"Хайде на Балкана!\"", "Крещим, но щом изтрезнеем,\nзабравяме думи, клетви,\nи немеем и се смеем\nпред народни свети жертви!", "А тиранинът върлува\nи безчести край наш роден:\nколи, беси, бие, псува\nи глоби народ поробен!", "О, налейте! Ще да пия!\nНа душа ми да олекне,\nчувства трезви да убия,\nръка мъжка да омекне!", "Ще да пия на пук врагу,\nна пук и вам, патриоти,\nаз вече нямам мило, драго,\nа вий... вий сте идиоти!"]
},
{
    title: "Моята молитва",
    content: [
        "    \"Благословен бог наш...\"",
        "О, мой боже, правий боже!\nНе ти, що си в небесата,\nа ти, що си в мене, боже -\nмен в сърцето и в душата...",
        "Не ти, комуто се кланят\nкалугери и попове\nи комуто свещи палят\nправославните скотове;",
        "не ти, който си направил\nот кал мъжът и жената,\nа човекът си оставил\nроб да бъде на земята;",
        "не ти, който си помазал\nцаре, папи, патриарси,\nа в неволя си зарязал\nмойте братя сиромаси;",
        "не ти, който учиш робът\nда търпи и да се моли\nи храниш го дор до гробът\nсамо със надежди голи;",
        "не ти, боже на лъжците,\nна безчестните тирани,\nне ти, идол на глупците,\nна човешките душмани!",
        "А ти, боже, на разумът,\nзащитниче на робите,\nна когото щат празнуват\nденят скоро народите!",
        "Вдъхни секиму, о, боже!\nлюбов жива за свобода -\nда се бори кой как може\nс душманите на народа.",
        "Подкрепи и мен ръката,\nта кога въстане робът,\nв редовете на борбата\nда си найда и аз гробът!",
        "Не оставяй да изстине\nбуйно сърце на чужбина,\nи гласът ми да премине\nтихо като през пустиня!..."
    ]
},
{
    title: "Зададе се облак темен",
    content: [
        "Зададе се облак темен\nоткъм гора, от Балкана;\nдали ще е дъждец дребен,\nили ще е буря страшна?",
        "Ех, мой дядо, тежко време!\nРалото се едвам влачи\nи след него сееш семе,\nпот от чело, град от очи!",
        "Кажи, дядо, защо плачеш\nнад тез дълги бразди черни;\nот чер облак ли се плашиш,\nили мрат ти деца дребни?",
        "Кажи, дядо, че аз помня\nкакъв юнак напред беше;\nбог да прости баба Стойна,\nтя пееше, ти ореше.",
        "Друг път - помниш? - лани беше:\nаз заминах през гората,\nсред юнаци ти седеше\nкато баща със брадата.",
        "Какъв беше ти тогава!\nСега плачеш - защо, дядо?\nБайряк ли се не развява,\nили нямаш сърце младо?",
        "\"Ех, мой синко! Що ме питаш?\nЧуй тоз гарван, де там грачи...\nНо в село нели отиваш,\nще да видиш защо плаче",
        "стар войвода след туй рало!\nТам селото се е сбрало\nна мегданя, за да гледа\nмойте момци, мойте чеда!",
        "Ти ще видиш там набити\nна прътове, на върлини\nна момците ми главите -\nизбиха се две дружини!",
        "Двама братя воеводи,\nдвамата ми верни сина:\nскарали се кой да води\nбащината си дружина!",
        "Тесни били планините\nза несговорна дружина!\nИ стърчат им днес главите,\nза да плаче кой как мине.",
        "Боже, с гръм ти разсипи ме!\nВетре, в прах ти разнеси ме!\nДа не гледам деца малки\nи техните клети майки,",
        "окол пръте как се късат -\nръце вдигат към главите,\nи как после ще се мъчат\nголи, боси и пребити.\"",
        "Закапаха едри капки,\nлетят, крякат гъски, патки:\nбуря страшна ще да ревне,\nнели не са капки дребни.",
        "секи тича, в село бяга,\nдядо не ще да разпряга.\n- Хайде, дядо, да вървиме.\n\"Стой да умра, помогни ми!\""
    ]
},
{
    title: "Обесването на Васил Левски",
    content: ["О, майко моя, родино мила,\nзащо тъй жално, тъй милно плачеш?\nГарване, и ти, птицо проклета,\nна чий гроб там тъй грозно грачеш ?", "Ох, зная, зная, ти плачеш, майко,\nзатуй, че ти си черна робиня,\nзатуй, че твоят свещен глас, майко,\nе глас без помощ, глас във пустиня.", "Плачи! Там близо край град София\nстърчи, аз видях, черно бесило,\nи твой един син, Българийо,\nвиси на него със страшна сила.", "Гарванът грачи грозно, зловещо,\nпсета и вълци вият в полята,\nстарци се молят богу горещо,\nжените плачат, пищят децата.", "Зимата пее свойта зла песен,\nвихрове гонят тръни в полето,\nи студ, и мраз, и плач без надежда\nнавяват на теб скръб на сърцето."]
}
];
