import { Link as MaterialLink } from '@mui/material';
import { Fragment } from 'react';
import FloatingImage from '@/components/Layouts/FloatingImagesPage/FloatingImage';
import FloatingImagesPage from '@/components/Layouts/FloatingImagesPage/FloatingImagesPage';
import TwoColumnsView from '@/components/Layouts/TwoColumnsView';
import CarouselBootstrap from '@/components/UI/CarouselBootstrap';
import MasterDetailTable from '@/components/UI/MasterDetailTable';
import DetailContent from '@/components/UI/MasterDetailTable/DetailContent';
import image from "@/images/flag-uk.png";
import classes from './BoteviChetnitsi.module.scss';
import Link from 'next/link';
import { uploadsUrl } from '@/utils/data';

function BoteviChetnitsi() {
    const pageTitle = 'Ботеви четници';
    function createData(id, imageUrl, name, years, born, died, content) {
        return {
            id,
            imageUrl,
            name,
            years,
            born,
            died,
            content,
        };
    }

    const originalRows = [
        createData(
            1,
            "https://muzeibotev.com/clients/152/files/images/snimki%20004.jpg",
            "Христо Ботев Петков",
            28,
            { date: "6 януари, 1848 г.", place: "Калофер" },
            { date: "2 юни, 1876 г.", place: "Врачански балкан" },
            `Роден е на 6 януари 1848 година (25 декември 1847 година стар стил) в Калофер, в семейството на даскал Ботьо Петков (1815 – 1869) и Иванка Ботева (1823 – 1911).[2] Съществуват и други хипотези за родното му място, които днес се отхвърлят от изследователите – че той е „из Карлово“, както пише в едно официално писмо на Найден Геров, или че е роден в село Осен, както споменава самият Ботев в статията си „Примери от турското правосъдие“.[3]`
        ),
        createData(
            2,
            "https://muzeibotev.com/clients/152/files/images/73.jpg",
            "Никола Войновски",
            28,
            { date: "6 януари, 1848 г.", place: "Калофер" },
            { date: "2 юни, 1876 г.", place: "Врачански балкан" },
            'Войновски е избран за войвода на четата и под негово ръководство тя води последния си бой в района на с. Лютиброд. Остатъкът от дружината се разпада на части. По това време към него се присъединяват Димитър Тодоров – Димитрото и още няколко оцелели четници от Ботевата чета и тръгват към Троянския балкан. С 15 души Войновски се добира до Троянския балкан. На 13 юни 1876 г. в района на с. Шипково четата е разбита окончателно. Никола Войновски е убит на 15 юни /28 юни по нов стил/ 1876 г., ударен в гърдите. Смъртоносно ранен успява да пропълзи десетина метра, като подкрепял своите другари с думите:"Дръжте се, момчета!" Така разказва Димитър Тодоров, който е бил ранен в ръката и е станал свидетел на гибелта на Никола Войновски.'
        ),
        createData(
            3,
            image,
            "Георги Апостолов Минчев",
            3,
            { date: "6 януари, 1848 г.", place: "Калофер" },
            { date: "2 юни, 1876 г.", place: "Врачански балкан" },
            "Георги Апостолов е роден е през юни 1853 г. в семейството на богат търговец на абаджийска стока и откупвач на натуралния десятък от Ески Заара. Завършва училище в родния си град. Бил е счетоводител в търговска кантора и търговец. Член на Старозагорския частен революционен комитет на ВРО, основан от Васил Левски. Участва в подготовката на Старозагорското въстание (1875). След неуспеха му избягва в Румъния."
        ),
        createData(
            4,
            "https://muzeibotev.com/clients/152/files/images/65.jpg",
            "Никола Обретенов",
            2,
            { date: "6 януари, 1848 г.", place: "Калофер" },
            { date: "2 юни, 1876 г.", place: "Врачански балкан" },
            "Никола Обретенов е роден на 28 май 1849 г. в град Русе. Семейството е на Тихо Обретенов (заможен и просветен за времето си българин, който е обсъждал „народните български дела“ с Раковски) и на прочутата Тонка Обретенова. Има четирима братя и две сестри. Всичките са неразривно свързани с националноосвободителните борби на българския народ. Братята му Ангел Обретенов и Петър Обретенов са четници в четата на Хаджи Димитър и Стефан Караджа. По-малкия му брат Георги е убит като четник в Сливенската чета на Стоил войвода (1876)."
        ),
        createData(
            5,
            "https://muzeibotev.com/clients/152/files/images/65.jpg",
            "Никола Обретенов",
            30,
            { date: "6 януари, 1848 г.", place: "Калофер" },
            { date: "2 юни, 1876 г.", place: "Врачански балкан" },
            "Никола Обретенов е роден на 28 май 1849 г. в град Русе. Семейството е на Тихо Обретенов (заможен и просветен за времето си българин, който е обсъждал „народните български дела“ с Раковски) и на прочутата Тонка Обретенова. Има четирима братя и две сестри. Всичките са неразривно свързани с националноосвободителните борби на българския народ. Братята му Ангел Обретенов и Петър Обретенов са четници в четата на Хаджи Димитър и Стефан Караджа. По-малкия му брат Георги е убит като четник в Сливенската чета на Стоил войвода (1876)."
        ),
        createData(
            6,
            "https://muzeibotev.com/clients/152/files/images/65.jpg",
            "Никола Обретенов",
            28,
            { date: "6 януари, 1848 г.", place: "Калофер" },
            { date: "2 юни, 1876 г.", place: "Врачански балкан" },
            "Никола Обретенов е роден на 28 май 1849 г. в град Русе. Семейството е на Тихо Обретенов (заможен и просветен за времето си българин, който е обсъждал „народните български дела“ с Раковски) и на прочутата Тонка Обретенова. Има четирима братя и две сестри. Всичките са неразривно свързани с националноосвободителните борби на българския народ. Братята му Ангел Обретенов и Петър Обретенов са четници в четата на Хаджи Димитър и Стефан Караджа. По-малкия му брат Георги е убит като четник в Сливенската чета на Стоил войвода (1876)."
        ),
        createData(
            7,
            "https://muzeibotev.com/clients/152/files/images/65.jpg",
            "Никола Обретенов",
            28,
            { date: "6 януари, 1848 г.", place: "Калофер" },
            { date: "2 юни, 1876 г.", place: "Врачански балкан" },
            "Никола Обретенов е роден на 28 май 1849 г. в град Русе. Семейството е на Тихо Обретенов (заможен и просветен за времето си българин, който е обсъждал „народните български дела“ с Раковски) и на прочутата Тонка Обретенова. Има четирима братя и две сестри. Всичките са неразривно свързани с националноосвободителните борби на българския народ. Братята му Ангел Обретенов и Петър Обретенов са четници в четата на Хаджи Димитър и Стефан Караджа. По-малкия му брат Георги е убит като четник в Сливенската чета на Стоил войвода (1876)."
        ),
        createData(
            8,
            "https://muzeibotev.com/clients/152/files/images/65.jpg",
            "Никола Обретенов",
            28,
            { date: "6 януари, 1848 г.", place: "Калофер" },
            { date: "2 юни, 1876 г.", place: "Врачански балкан" },
            "Никола Обретенов е роден на 28 май 1849 г. в град Русе. Семейството е на Тихо Обретенов (заможен и просветен за времето си българин, който е обсъждал „народните български дела“ с Раковски) и на прочутата Тонка Обретенова. Има четирима братя и две сестри. Всичките са неразривно свързани с националноосвободителните борби на българския народ. Братята му Ангел Обретенов и Петър Обретенов са четници в четата на Хаджи Димитър и Стефан Караджа. По-малкия му брат Георги е убит като четник в Сливенската чета на Стоил войвода (1876)."
        ),
        createData(
            9,
            "https://muzeibotev.com/clients/152/files/images/65.jpg",
            "Никола Обретенов",
            28,
            { date: "6 януари, 1848 г.", place: "Калофер" },
            { date: "2 юни, 1876 г.", place: "Врачански балкан" },
            "Никола Обретенов е роден на 28 май 1849 г. в град Русе. Семейството е на Тихо Обретенов (заможен и просветен за времето си българин, който е обсъждал „народните български дела“ с Раковски) и на прочутата Тонка Обретенова. Има четирима братя и две сестри. Всичките са неразривно свързани с националноосвободителните борби на българския народ. Братята му Ангел Обретенов и Петър Обретенов са четници в четата на Хаджи Димитър и Стефан Караджа. По-малкия му брат Георги е убит като четник в Сливенската чета на Стоил войвода (1876)."
        ),
        createData(
            10,
            "https://muzeibotev.com/clients/152/files/images/65.jpg",
            "Никола Обретенов",
            28,
            { date: "6 януари, 1848 г.", place: "Калофер" },
            { date: "2 юни, 1876 г.", place: "Врачански балкан" },
            "Никола Обретенов е роден на 28 май 1849 г. в град Русе. Семейството е на Тихо Обретенов (заможен и просветен за времето си българин, който е обсъждал „народните български дела“ с Раковски) и на прочутата Тонка Обретенова. Има четирима братя и две сестри. Всичките са неразривно свързани с националноосвободителните борби на българския народ. Братята му Ангел Обретенов и Петър Обретенов са четници в четата на Хаджи Димитър и Стефан Караджа. По-малкия му брат Георги е убит като четник в Сливенската чета на Стоил войвода (1876)."
        ),
        createData(
            11,
            "https://muzeibotev.com/clients/152/files/images/65.jpg",
            "Никола Обретенов",
            28,
            { date: "6 януари, 1848 г.", place: "Калофер" },
            { date: "2 юни, 1876 г.", place: "Врачански балкан" },
            "Никола Обретенов е роден на 28 май 1849 г. в град Русе. Семейството е на Тихо Обретенов (заможен и просветен за времето си българин, който е обсъждал „народните български дела“ с Раковски) и на прочутата Тонка Обретенова. Има четирима братя и две сестри. Всичките са неразривно свързани с националноосвободителните борби на българския народ. Братята му Ангел Обретенов и Петър Обретенов са четници в четата на Хаджи Димитър и Стефан Караджа. По-малкия му брат Георги е убит като четник в Сливенската чета на Стоил войвода (1876)."
        ),
        createData(
            12,
            "https://muzeibotev.com/clients/152/files/images/65.jpg",
            "Янко Сакъзов Обретенов",
            28,
            { date: "6 януари, 1848 г.", place: "Калофер" },
            { date: "2 юни, 1876 г.", place: "Врачански балкан" },
            "Никола Обретенов е роден на 28 май 1849 г. в град Русе. Семейството е на Тихо Обретенов (заможен и просветен за времето си българин, който е обсъждал „народните български дела“ с Раковски) и на прочутата Тонка Обретенова. Има четирима братя и две сестри. Всичките са неразривно свързани с националноосвободителните борби на българския народ. Братята му Ангел Обретенов и Петър Обретенов са четници в четата на Хаджи Димитър и Стефан Караджа. По-малкия му брат Георги е убит като четник в Сливенската чета на Стоил войвода (1876)."
        ),
    ];

    const dummyColumns = [
        {
            id: "name",
            headerText: "Име",
            sortable: true,
            numeric: false,
            avatar: true,
            classesOuter: `${classes["name-cell"]}`,
            classesInner: `${classes["header__text--name-title"]}`,
        },
        {
            id: "years",
            headerText: "Години",
            headerTextSubtitle: "(Kъм 1876 г.)",
            sortable: true,
            numeric: true,
            classesOuter: `${classes["years-cell"]}`,
            classesInner: `${classes["header__text--years-old-title"]}`,
        },
        {
            id: "born",
            headerText: "Роден",
            objectType: true,
            classesOuter: `${classes["responsive-cell"]}`,
            classesRowInner: classes['row-inner']
        },
        {
            id: "died",
            headerText: "Починал",
            objectType: true,
            classesOuter: `${classes["responsive-cell"]}`,
            classesRowInner: classes['row-inner']
        },
    ];

    return (
        <Fragment>
            <CarouselBootstrap items={[{ src: `${uploadsUrl}/botevi-chetnitsi.jpg`, title: "Ботевите четници" }]}></CarouselBootstrap>
            <TwoColumnsView history={{ nachalo: 'Начало', 'boteva-cheta': 'Ботева чета', 'istoriya': pageTitle }} table>
                <h2>{pageTitle}</h2>
                <FloatingImagesPage>
                    <Fragment>
                        <h3>Източници</h3>
                        <FloatingImage className={classes['wide-screen']} small src="https://alba-books.com/image/cache/data/0003/zhrisk-372x505.jpg" right />
                        <p>Спомените на оцелелите Ботеви четници са записани и издадени между 1900-1930 г. Най-голям принос в съставянето на първите списъци на четата имат Захари Стоянов, Андрей Матеев, Никола Обретенов, Илия Цанов, Г. Димитров, Никола Кючуков и Димитър Страшимиров.</p>
                        <FloatingImage small className={classes['wide-screen']} src="https://knigizateb.com/1839/%D1%85%D1%80%D0%B8%D1%81%D1%82%D0%BE-%D0%B1%D0%BE%D1%82%D0%B5%D0%B2.jpg" />
                        <p>Най-пълният и исторически достоверен списък на четата, е дело на Радка Стоянова, но и в него много от Ботевите четници са известни само с имената си, без по-подробни данни за живота им, без запазени снимки. Според този списък Ботевите четници са 205-ма.</p>
                    </Fragment>
                </FloatingImagesPage>
                <Fragment>
                    <h3>Състав на Ботевата чета</h3>
                    <MasterDetailTable originalRows={originalRows} columns={dummyColumns} filterBy="name">
                        <DetailContent />
                    </MasterDetailTable>
                    <br />
                    <MaterialLink component={Link}  href="/bg/boteva-cheta/istoria">Ботева чета - история и боен път</MaterialLink>
                </Fragment>
            </TwoColumnsView>
        </Fragment>
    )

}

export default BoteviChetnitsi;